document.getElementById("text").innerHTML = Markov(
  Arr(
    "この土日は、特に書くことのあるイベントはなかった。11月はいつもたくさんイベントがあるはずなのに、何を書いていいのかわからない。何を書けばいいのだろうか。日記って何だろうか。今日は、昼ごはんが塩ラーメンだったくらいだ。本当に何を書こうかとぼくは、悩んだ。今日は、朝起きて、宿題やって、Linuxいじって、漫画読んで、漫画読んで、ご飯食べて、日記のテーマ考えて、考えたくらいだ。本当に何を書こうかと悩んだ。勤労感謝の日にどこかに出かけたような気がしなくもないが、あまりよく覚えていない。学校行事もマラソン大会もあるけれど、特に思いもない。だから、何を書いていいのかわからない。ずっと音楽を聞きながら、考えていたせいかもしれない。Linuxのことを書こうか、いや書くのがめんどくさいかも、などと考えた。なんでこんなしょうもないことで、書くことを躊躇しているのだろうか。書くテーマが思いつかないということは、平和な日常ということでいいのだろうか。落ち着いているからいいのだろうか。ぼくは、閃いた。「日記のテーマが思いつかないなら、それを日記にしよう」と。このテーマであれば、いつでもかけるのではないか、と。そして、今、511文字もかけていることに気づいた。そして今は、536文字だ。そんなことでもいいかと思うかもしれないが、日を記したもので、『日記』だから、これでもいいのではないだろうか。たくさん書くことは、あったような気がするけど、とりあえず、日を記すことができたので、いいのではないかと思った。今気づいたのだが、これでいつもよりも長く書けた。ぼくは、なんとなくテレビをつけた。そこでは、東京ヴェルディ対清水エスパルスのサッカーの試合をやっていた。なんと、J1昇格をかけた重要な試合だったそうだ。東京で行われた。東京ヴェルディは、昇格すれば16年ぶり、清水エスパルスは、1年で戻ることになる。ぼくは、何となくゲームをみながら試合をみていた。スマブラを一人でやっていた。祖父母の家にいたが、祖母は、「何で頭てかてかしているの？」とか、「サッカーは転ぶゲームなの？」とかと言っていた。正直どうでもよかった。そして、あっという間に前半の試合は終わっていった。試合はどんどん進んでいった。そして後半が始まった。しばらくして、清水エスパルスのPKがあった。選手は、チアゴ・サンタナという人だ。そして、ゴールが入り、清水エスパルスに一点が入った。もちろん、同じ静岡県民としてうれしかった。しかし、試合終了直前、ヴェルディのPKがあった。それで、ヴェルディに一点が入った。そのまま、1-1の同点で、試合が終了した。同点の場合、順位の高い、東京ヴェルディがJ1に昇格する。だから、残念ながら、清水エスパルスがJ2に残留することになってしまった。めでたしめでたし。昨日、貴船学習発表会があった。自分にとっては、最後の学習発表会になった。ぼくは、五年生と一年生の発表をみた。五年生の発表は、「きぶねエコプロジェクト」だ。自分の時とは、少しテーマが違った。節水、ゴミを減らす、ゴミを分別するというものだった。特に、ぼくは、ゴミ分別ゲームというものが面白いと思った。ゴミの分別というものを、ゲームするという発想が面白いと思いました。一年生の発表は、秋のものでゲームを作るというものだった。松ぼっくりを釣るゲーム、秋のもので作られた迷路などがあった。とても楽しく、時間を忘れて、夢中になってしまった。一年生を見ていると、昔を思い出したような気がした。自分は、「富士宮市のホームページをリニューアル」というテーマでやりました。他の人とは違う独自のテーマにしたが、うまく発表できたと思った。多くの質問をしていただき、より具体的に考えることができたような気がした。この学習発表会では、色々なことを学び、深められた。貴船学習発表会は、来週の土曜日、今からちょうど一週間だ。自分にとっては、最後の貴船学習発表会である。そんな最後の学習発表会のテーマは、「貴船未来構想」だ。富士宮市をよりよくするために、パネルディスカッションを行うものだ。自分のテーマは、「ホームページをリニューアル」だ。観光客を増やすためには、第一印象が重要だと思ったからだ。実は、これまで調べてきたテーマと変えた。今まで調べてきたテーマでは、なんかうまくできないと考えたからだ。そのため、この土日は準備が大変だった。自分は、他の学年を見るのが楽しみだ。一年生のお店は、見ていて楽しく、発想がおもしろい。今年は、どんなゲームを作ってくれるのか楽しみだ。五年生は、今年は、自分たちのころとは違い、エコについてやるそうだ。どのようにやれば、地球の環境にいいのか、改めて、知りたいと思う。また、積極的に感想を伝えたいと思う。最後の貴船学習発表会となる。そのため、しっかり、学習を深め、いい発表会にしたい。今日から四日後の10/26から10/27に修学旅行が行われる。今年も、例年通り東京にいくことになっている。ぼくは、日本科学未来館が楽しみだ。そんな修学旅行のぼくの目標は、「思い出に残す」ということだ。ぼくの目標の「思い出を残す」というのを達成するために何ができるのだろうか。例えば、形に残すことだ。思い出が蘇るようなお土産を買おうということだ。そのため、お土産は、普段使ったり、見たりする、そんなものを買ってみたい。ボールペンや、模型、ストラップなどだ。このようにすれば、思い出に残るのではないのだろうか。やはり、思い出は、楽しいものがいい。せっかく思い出が蘇っても、悲しいことだったら、あまりいい気分にはならない。だから、修学旅行は、全力で楽しみたい。修学旅行を楽しいものにできたら、いいことがたくさんある。楽しいと色々なことを覚えられると思うし、さらに、記憶に残すこともできる。しかし、集団生活をする中では、大変なこともあると思う。でも、そのようなことがあっても、最後に楽しかったと言える修学旅行にしたいと思う。自分は、修学旅行を、ぼくの目標「思い出に残す」を意識して、最高なものにしていきたい。ぼくは、毎年、富士宮祭りに参加している。ぼくは、いつも盛り上がり、楽しかったので、いつも楽しみにしていた。しかし、ぼくが、三年生、四年生のころは、新型コロナウイルス感染症拡大防止のため、富士宮祭りは中止だった。去年は、規模を縮小して行ったので、今年は、コロナ前と同じようにやって欲しいというように思った。富士宮祭りといえば、富士宮囃子だ。静岡県指定無形民俗文化財に登録されている。宮参りの時や、山車の引き回しの時、本宮の時に演奏する。いくつか曲があり、山車の引き回しの時には、「にくずし」を演奏する。自分の区では、小学六年生が、主に奉納ばやしをやる。その時は、「屋台」というものをやる。これは、競り合いの時にやるのだが、今年、初めて演奏することになる。ぼくが、富士宮祭りの中で一番好きなのは、競り合いの時だ。お互いの区が「屋台」というものを演奏し合い、勝敗を決める（今は決めない）。夜にやることが多いので、山車がとても映え、盛り上がるからだ。特に、三組以上の組でやるのが、楽しい。今年は、規模がどうなるか、まだわからない。でも、今年は、小学生最後の祭りになるので、楽しみたい。そのために、今日から始まる富士宮囃子の練習をして、盛り上がる祭りにしたい。今週の土曜日に、運動会があった。ぼくは、六年生だから、小学校最後の運動会だった。スローガンは、『全力!!協力!!輝くえがの運動会』だった。六年生は、主に、三つの競技を行った。『心を一つに　つなげ！バトン』、『NO SIDE　竹取合戦』、『共に羽ばたけ　173の翼』である。ぼくは、六年生だ。だから、運動会を行うための係を決めた。自分は、運営委員会だから、運営係だった。主に、開会式と、閉会式の進行をやった。休み時間にも、多くの準備をして、盛り上がるように頑張った。本番は、緊張はしたけれど、うまくできたみたいでよかった。自分がこの運動会で楽しかったことは、他の人の競技を見ることだった。ぼくの係は、運営だから、開会式と閉会式以外には、仕事がない。だから、友達と話しながら勝敗を予想してみたり、応援したりした。やはり、みんな、楽しそうにやっていて、みていて気持ちがよかった。見るのも楽しいが、やはり自分たちがやるのも面白かった。リレーで、ぼくは、全力を出しきれなかった。自分は、内側のコースが苦手で、いつも大きく広がってしまう。しかも、一番で、内側のコースになってしまい、とても遅くなってしまった。しかし、クラス全体では、一学期にたくさん練習した、バトンパスをうまく活用できていたように感じた。結果は、三位で残念だったけれど、クラスで力を合わせられたというように思った。表現運動のフラッグは、とてもうまくできたと思う。自分自身のミスが、ほとんどなかったのもあるが、なりよりも、みんなが揃っていて、堂々とやってたということがよかったと思った。六年生最後の運動会の最後の競技としてふさわしいものになったと、ぼくは思う。この運動会は、小学校最後の運動会となった。ぼくは、最高にいい運動会になったと思う。なぜなら、みんなが協力し、楽しんでいたからだ。中学生になっても、同じように、運動会を全力で楽しみたい。兄は、今年の四月から、沼津高専（独立行政法人国立高等専門学校機構沼津工業高等専門学校）に通っています。沼津高専は、ほとんど大学と休みの期間が同じで、春休みがとても長いです。夏休みも、もちろん長く、一ヶ月半近くもあります。今年の兄の夏休みは、八月の上旬から、九月の中旬までです。ぼくたちよりも、始まるのが遅く、終わるのもとても遅いです。やっと今週の火曜日から、学校が始まるそうです。兄が四月に沼津高専に通い始めてから、兄は寮に住んでいました。そのため、長い間家にいたことは、四月からありませんでした。兄がいなかったのは、少し寂しかったです。でも、兄は、たまに帰って来た時に、学校は楽しいと話していたのでよかったです。兄は、八月の上旬に帰ってきて、いろいろな話を聞きました。例えば、テストの成績です。学校では、テストの成績がよく、クラスで五番目だったそうです。そして、赤点が一つもなかったそうです。ですが、文系の方がテストの成績がよかったみたいで、なんとなく悲しそうでした。夏休みに、「Eスタ」というものがあり、兄は、二週間浜松にいました。これは、クラスでの勉強合宿だそうです。二週間も勉強し、とても学力が身についたと思ったと話していました。反面、ずっと集団生活で、疲れてしまったと言っていました。また、工場の見学にも行ったそうで、とても楽しく、勉強になったそうです。先輩と話したaことも、勉強になったそうです。兄は、また、学校へ帰ってしまい、なかなか会えなくなりますが、これからも仲良くしたいと思います。「運動会を盛り上げるためにできることはなんだろう。」今から約一ヶ月後の十月七日に運動会がある。ぼくの学年は、タイヤ取り・棒取り、リレー、表現運動を行う。学校では、やっと、表現運動の練習が始まった。この前、運動会のスローガンに入れる言葉を考える学級会で、気持ちを高める方法を考えた。その中で、運動会のHPを作るという意見があった。実現が難しいという理由と、内容が分からないという理由で却下された。しかし、ぼくは、うまくできたら、盛り上がるし、面白いと考えた。ぼくは、プログラミングが趣味だ。そのため、ぼくは、そのようなものを作るのがとても楽しい。だから、ぼくは、趣味として、そして、盛り上げるために作ってみたい。このHPには、カウントダウンカレンダーや、スローガンのこと、日程などを入れたい。そして、サイトでしかできないことを入れたい。ぼくは、そこで、パソコンで運動会に向けた意気込みをかいてもらい、それを自動で表示することをしたい。意気込みを書いた紙をポストに入れてもらい、それを紙に貼るということもできるが、とても大変だ。だから、ぼくは、運動会の特設ページを作ってみたい。この運動会は、小学生最後の運動会。だから、ぼくは、ちゃんと練習して、運動会に臨みたい。リレーやタイヤとりなどがあるが、ぼくは、特に、表現運動を頑張りたい。先述したように、この運動会は、小学生最後の運動会。どうせなら、いい表現をしたい。この運動会を盛り上げ、最高の運動会にしたい。先日、音楽鑑賞教室があった。『スギテツ』というデュオの二人がやってくださった。その演奏の中で特に印象に残った曲を紹介する。一つ目は、『犬のおまわりさん』と、『運命』を合わせた、『犬のおまわりさんの運命』だ。とても意外な組み合わせだった。なぜなら、明るい感じの曲と暗い感じの曲だからだ。犬のおまわりさんを短調にし、暗い感じにしていて面白いと思った。二つ目は、『線路は続くよどこまでも』だ。印象に残った理由は、アルミでできたバイオリンで演奏していたからだ。ぼくは、まずアルミでできたバイオリンで演奏できるということに驚いた。そして、最後の新幹線の音の真似がとても印象に残った。三つ目は、校歌のクラシックアレンジだ。校歌がクラシックになるなんて想像もつかなかった。若干、暗い感じになっているように感じたが、校歌の感じも残しつつ、クラシックになっていてすごいと思った。この音楽鑑賞教室、とても面白く、そして楽しかった。また、とても勉強になった。この音楽鑑賞教室を通して、もっと音楽が楽しいものだということを実感させられた。僕は、今年のゴールデンウイークはあまり出かけられず、いままでと違うゴールデンウイークになりました。しかし楽しかったことは２つあります。１つ目は、ズッコケ三人組シリーズなどたくさんの本を読んだことです。その中でも面白かったのはドリトル先生シリーズです。僕は家にこの本があったので読んでみました。この話は、ドリトル先生という動物と喋れる人が中心の物語です。僕はこのシリーズ全部をゴールデンウイーク中に読めなかったので、５年生のうちに全部読んでみたいです。２つ目は、料理をしたことです。僕はこの連休中にピザを母と作ってみました。生地を作って、具をのせて、焼くと出来上がります。とてもうまくでき、美味しかったので良かったです。僕は、この連休はコロナだから出かけられないし、途中で学校もあるので楽しくないと思っていました。けれども、このゴールデンウイークは出かけられなかったからこそ楽しいことも増えたので良かったと思います。ぼくの兄が沼津高専に入学し、寮に入寮してから、もうすぐ１ヶ月が経つ。ぼくの兄は、鉄道が好きなので、沼津高専に入学した。そして、ぼくの兄は寮に入寮した。今までは四人家族だったのだが、兄がいなくなって、三人になった。兄がいなくなってから、いろいろなことが変わった。例えば、寂しくなったということだ。ぼくの兄は、いつも面白く、家族を笑わせてくれる。また、兄はぼくにいろいろなことを教えてくれた。英検を受けた時には、面接の仕方について教えてくれた。また、ぼくは今、プログラミングの勉強をしているのだが、それについても教えてくれた。そんな兄がいなくなったので、とても寂しい。その反面、良いこともあった。ぼくは今まで、自分だけの部屋がなかったのだが、兄が家を出ていったので、余裕ができ、自分の部屋ができた。また、お菓子などをもらったり、買ったりするときも兄の分を考えなくてよくて、少し楽になった。良いこともあったが、やはり兄がいなくなったということは、とても寂しく、これからが不安だ。けれど、これからは、兄がいなくても、楽しく、明るい家族を築きあげていきたい。ぼくの将来の夢は、起業し、エンジニアとして働くことです。ぼくは、エンジニアになって、皆の生活がよりよくなるようなサービスをたくさん作りたいです。ぼくが、起業し、エンジニアになりたい理由は、二つあります。一つ目の理由は、パソコンが好きだからです。ぼくは、昔からパソコンをいじるのが好きで、ゲームしている時間より、パソコンをいじっている時間の方が多いくらいです。ぼくは、最近、プログラミングの勉強をしています。Pathon、HTML、Rubyなどさまざまなプログラミング言語がありますが、プログラミングの勉強をしていると、こんなことができるのか、という風に思い、楽しいし、ワクワクします。そんな楽しいし、ワクワクすることを仕事にできるのは、とてもいいと思ったからです。二つ目の理由は、自分は統計学に興味があるからです。ぼくは、とても算数が好きです。算数の中でも、並べ方・組み合わせ方など、統計学につながることが、「面白い」と感じたからです。そのようなことに興味があるので、自分は、経営者に向いているのではないかと思ったからです。以上の二つの理由から、ぼくは起業し、エンジニアとして働きたいです。起業するのは、難しいかもしれないけど、たくさん勉強して、自分の夢を叶えたいです。　ぼくは今年、六年生になった。六年生は、学校のリーダーとして、みんなのお手本でなくてはならない。また、六年生は、五年生とともに学校を支えていく必要がある。そんな、六年生になったぼくには、二つの頑張りたいことがある。一つ目は、片付けをすることだ。ぼくは、とても片付けが苦手だ。なので、すぐに物をなくし、それを探すのにいつもすごく時間がかかってしまう。また、机の中も片付けず、いつも使いづらい。そのようなことがないためには、定期的に片付けをし、いつも綺麗で使いやすい状態にすることが大切だと思う。また、片付けるときにどこに何をおくかをしっかり決めると、もっと物をなくさなくなるのではないかと思った。二つ目は、委員会だ。ぼくは運営委員会に入っている。運営委員会では、今年からナイスポストという物を二年ぶりに再開しようと考えている。また、Webサイトを作って、そのナイスポストの募集や、代表委員会のテーマの募集をしようと思っている。それを実現させるためにも、委員会を頑張ろうと思った。六年生は色々大変で、がんばらければならないことがたくさんある。だからこそ、成長できると思うから、この一年は頑張って、いろいろなことに挑戦したい。",
    2
  ),
  "ぼく"
);

function Arr(sentence, number) {
  let newNumbwe = new RegExp(`.{1,${number}}`, "g");
  let words = sentence.match(newNumbwe);
  for (let i = 1; i < number; i++) {
    words = words.concat(sentence.slice(i, sentence.length).match(newNumbwe));
  }

  let data = {};
  for (let i = 0; i < words.length; i++) {
    if (data[words[i]] == undefined) {
      if (words[i + 1] != undefined) {
        data[words[i]] = [words[i + 1]];
      }
    } else {
      if (words[i + 1] != undefined) {
        data[words[i]].push(words[i + 1]);
      }
    }
  }
  return data;
}

function Markov(array, words) {
  let sentence = words;
  let keep = array[words];
  if (keep === undefined) return "エラー";
  let span = keep.length;
  let random = Math.floor(Math.random() * span);
  for (let i = 0; i < 5000; i++) {
    sentence += keep[random];
    keep = array[keep[random]];
    span = keep.length;
    random = Math.floor(Math.random() * span);
  }
  return sentence;
}
